Infineon/mtb-example-psoc6-freertos-bluetooth-ui-demo/source/bt/bt_app.c
    if ( NULL != p_conn_status )
    {
        if (p_conn_status->connected)
        {
            /* Device has connected */
            printf("Bluetooth connected with device address:" );
            bt_print_bd_address(p_conn_status->bd_addr);
            printf("Bluetooth device connection id: 0x%x\r\n", p_conn_status->conn_id);
            /* Store the connection ID */
            bt_connection_id = p_conn_status->conn_id;
            board_led_set_state(USER_LED1, LED_OFF);
        }
        else
        {
            /* Device has disconnected */
            printf("Bluetooth disconnected with device address:" );
            bt_print_bd_address(p_conn_status->bd_addr);
            printf("Bluetooth device connection id: 0x%x\r\n", p_conn_status->conn_id);
            /* Set the connection id to zero to indicate disconnected state */
            bt_connection_id = 0;
            /* Restart the advertisements */
            result = wiced_bt_start_advertisements(BTM_BLE_ADVERT_UNDIRECTED_HIGH,
                                                                         0, NULL);
            /* Failed to start advertisement. Stop program execution */
            if (CY_RSLT_SUCCESS != result)
            {
                CY_ASSERT(0);
            }
            board_led_set_blink(USER_LED1, BLINK_SLOW);
        }
        status = WICED_BT_GATT_SUCCESS;
    }

    return status;
}

/*******************************************************************************
 * Function Name: bt_app_free_buffer
 *******************************************************************************
 * Summary:
 *  This function frees up the memory buffer
 *
 * Parameters:
 *  uint8_t *p_data: Pointer to the buffer to be free
 * 
 * Return:
 *  None
 *
 ******************************************************************************/
void bt_app_free_buffer(uint8_t *p_buf)
{
    vPortFree(p_buf);
}

/*******************************************************************************
 * Function Name: bt_app_alloc_buffer
 *******************************************************************************
 * Summary:
 *  This function allocates a memory buffer.
 *
 *
 * Parameters:
 *  int len: Length to allocate
 * 
 * Return:
 *  None
 *
 ******************************************************************************/
void* bt_app_alloc_buffer(int len)
{
    return pvPortMalloc(len);
}

/*******************************************************************************
 * Function Name : bt_app_find_by_handle
 * *****************************************************************************
 * Summary :
 *    Find attribute description by handle
 *
 * Parameters:
 *  uint16_t handle    handle to look up
 *
 * Return:
 *  gatt_db_lookup_table_t   pointer containing handle data
 * 
 ******************************************************************************/
gatt_db_lookup_table_t  *bt_app_find_by_handle(uint16_t handle)
{
    for (uint8_t i = 0; i < app_gatt_db_ext_attr_tbl_size; i++)
    {
        if (handle == app_gatt_db_ext_attr_tbl[i].handle)
        {
            return (&app_gatt_db_ext_attr_tbl[i]);
        }
    }
    return NULL;
}


/*******************************************************************************
* Function Name: bt_app_send_indication
********************************************************************************
* Summary: Sends GATT indication.
*
* Parameters:
*    None
*
* Return:
*  None
*
*******************************************************************************/
void bt_app_send_indication(void)
{
    wiced_bt_gatt_status_t status = WICED_BT_GATT_ERROR;

    if((GATT_CLIENT_CONFIG_INDICATION == \
                            app_hts_temperature_measurement_client_char_config[0])
                            && (0 != bt_connection_id))
     {

        status = wiced_bt_gatt_server_send_indication( bt_connection_id,
                                        HDLC_HTS_TEMPERATURE_MEASUREMENT_VALUE,
                                        app_gatt_db_ext_attr_tbl[8].cur_len,
                                        app_gatt_db_ext_attr_tbl[8].p_data,NULL);

        if(WICED_BT_GATT_SUCCESS != status)
        {
            printf("Sending temperature sensor indication failed\r\n");
        }

     }
}

/*******************************************************************************
* Function Name: bt_app_send_notification
********************************************************************************
* Summary: Sends GATT notification.
*
* Parameters:
*    None
*
* Return:
*  None
*
*******************************************************************************/
void bt_app_send_notification(void)
{
    wiced_bt_gatt_status_t status = WICED_BT_GATT_ERROR;

    if((GATT_CLIENT_CONFIG_NOTIFICATION == \
                            app_capsense_button_client_char_config[0])
                            && (0 != bt_connection_id))
    {
        /* CapSense button data to be send*/
        app_capsense_button[0] = capsense_data.buttoncount;
        app_capsense_button[1] = capsense_data.buttonstatus1;
        app_capsense_button[2] = capsense_data.buttonstatus2;
        status = wiced_bt_gatt_server_send_notification( bt_connection_id,
                                        HDLC_CAPSENSE_BUTTON_VALUE,
                                        app_gatt_db_ext_attr_tbl[2].cur_len,
                                        app_gatt_db_ext_attr_tbl[2].p_data,NULL);

        if(WICED_BT_GATT_SUCCESS != status)
        {
            printf("Sending CapSense button notification failed\r\n");
        }

    }

    if((GATT_CLIENT_CONFIG_NOTIFICATION == \
                                        app_capsense_slider_client_char_config[0])
                                        && (0 != bt_connection_id))
    {
        /* CapSense slider data to be send */
        app_capsense_slider[0] = capsense_data.sliderdata;
        status = wiced_bt_gatt_server_send_notification( bt_connection_id,
                                        HDLC_CAPSENSE_SLIDER_VALUE,
                                        app_gatt_db_ext_attr_tbl[4].cur_len,
                                        app_gatt_db_ext_attr_tbl[4].p_data,NULL);

        if(WICED_BT_GATT_SUCCESS != status)
        {
            printf("Sending CapSense slider notification failed\r\n");
        }

    }

}

/*******************************************************************************
* Function Name: bt_print_bd_address
********************************************************************************
* Summary: This is the utility function that prints the address of the 
*          Bluetooth device
*
* Parameters:
*  wiced_bt_device_address_t bdaddr : Bluetooth address
*
* Return:
*  None
*
*******************************************************************************/
void bt_print_bd_address(wiced_bt_device_address_t bdadr)
{
    for(uint8_t i=0;i<BD_ADDR_LEN-1;i++)
    {
        printf("%02X:",bdadr[i]);
    }
    printf("%02X\n",bdadr[BD_ADDR_LEN-1]);
}

/* END OF FILE [] */
